## Referances
1 : https://pandas.pydata.org/pandas-docs/stable/tutorials.html

2 : https://github.com/jrjohansson/scientific-python-lectures

3 : https://github.com/tpcarneiro/Python-Data-Science-and-Machine-Learning-Bootcamp

In [0]:
# from google.colab import files

# uploaded = files.upload()

# for fn in uploaded.keys():
#   print('User uploaded file "{name}" with length {length} bytes'.format(
#       name=fn, length=len(uploaded[fn])))

In [1]:
# !pip install pandas

import numpy as np
import pandas as pd

In [11]:
df = pd.read_csv('example_csv.csv')
df2 = pd.read_csv('example_csv_2.csv',delimiter='-')

# print(df)
# print(df2)

# df.to_csv('example_csv_save_true.csv')
# df.to_csv('example_csv_save_false.csv',index = False)


df = pd.read_csv('example_csv_save_true.csv')
df2 = pd.read_csv('example_csv_save_false.csv')

df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
# !pip install xlrd
# !pip install openpyxl

df = pd.read_excel("example_excel.xlsx")
df2 = pd.read_excel("example_excel.xlsx" , sheetname = 'Sheet2')

# df.to_excel('excel_save.xlsx',sheet_name='S1')

df = pd.read_excel("excel_save.xlsx")
df2 = pd.read_excel("excel_save.xlsx" , sheetname = 'S1')

/usr/local/lib/python3.6/dist-packages/pandas/util/_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [2]:
!pip install lxml
!pip install html5lib
!pip install BeautifulSoup4

Requirement already satisfied: lxml in d:\anacona\lib\site-packages (4.3.4)
Requirement already satisfied: html5lib in d:\anacona\lib\site-packages (1.0.1)
Requirement already satisfied: six>=1.9 in d:\anacona\lib\site-packages (from html5lib) (1.12.0)
Requirement already satisfied: webencodings in d:\anacona\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: BeautifulSoup4 in d:\anacona\lib\site-packages (4.7.1)
Requirement already satisfied: soupsieve>=1.2 in d:\anacona\lib\site-packages (from BeautifulSoup4) (1.8)

In [ ]:
df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

df[0]

In [2]:
import numpy as np
import pandas as pd

In [ ]:
labels = 'A B C D'.split()
print(labels)
my_data = [1,2,3,4]
arr = np.array(my_data)
dic = {'A':1 , 'B':2 , 'C':3 , 'D':4}
dic2 = {'A':1 , 'B':2 , 'C':3 , 'E':4}

In [41]:
sr = pd.Series(my_data,labels)
sr2 = pd.Series(dic2)

sr + sr2

A    2.0
B    4.0
C    6.0
D    NaN
E    NaN
dtype: float64

In [46]:
df = pd.read_csv('example_csv.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
from numpy.random import randint

arr = randint(-100,100,16).reshape(4,4)

arr

array([[ -85,   85,   23,  -53],
       [ -90, -100,   83,  -20],
       [   6,  -51,   84,   15],
       [ -54,   71,   81,   46]])

In [13]:
row = 'A B C D'.split()
col = 'E F G H'.split()

df = pd.DataFrame(data = arr , columns = col , index = row )

df

    E    F   G   H
A -85   85  23 -53
B -90 -100  83 -20
C   6  -51  84  15
D -54   71  81  46

In [17]:
print(df['E'])   #Column access in pandas
print(df[['E','F']])

A   -85
B   -90
C     6
D   -54
Name: E, dtype: int32
    E    F
A -85   85
B -90 -100
C   6  -51
D -54   71

In [18]:
print(df.loc['A'])  #ROW access in pandas

E   -85
F    85
G    23
H   -53
Name: A, dtype: int32

In [21]:
print(df.iloc[2])  #access 2nd row using numeric

E     6
F   -51
G    84
H    15
Name: C, dtype: int32

In [ ]:
#df['new'] = df['G'] + df['H']  added new column

In [38]:
df['new'] = df['G'] + df['H']  # added new column
df

    E    F   G   H  new
A -85   85  23 -53  -30
B -90 -100  83 -20   63
C   6  -51  84  15   99
D -54   71  81  46  127

In [39]:
df.loc['E'] = df.loc['C'] + df.loc['D']  # added new row
df

    E    F    G   H  new
A -85   85   23 -53  -30
B -90 -100   83 -20   63
C   6  -51   84  15   99
D -54   71   81  46  127
E -48   20  165  61  226

In [40]:
df.drop('new',axis = 1,inplace = True)  #bydefault axis 0 means row.  inplace = False. 
df

    E    F    G   H
A -85   85   23 -53
B -90 -100   83 -20
C   6  -51   84  15
D -54   71   81  46
E -48   20  165  61

In [41]:
df.drop('E',axis = 0,inplace = True)
df

    E    F   G   H
A -85   85  23 -53
B -90 -100  83 -20
C   6  -51  84  15
D -54   71  81  46

In [67]:
df = [df < 0]
print(df)

[       E      F      G      H
A   True  False  False   True
B   True   True  False   True
C  False   True  False  False
D   True  False  False  False]

In [83]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [84]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [85]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [86]:
df.dropna(axis = 0)  #row wise

     A    B  C
0  1.0  5.0  1

In [87]:
df.dropna(axis = 1)  #col wise

   C
0  1
1  2
2  3

In [89]:
df.dropna(thresh=2, axis=1)   #thresh=2 means two nan

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [91]:
df.fillna("FILL")

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [95]:
df

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [98]:
df.fillna("FILL", inplace = True)
df

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [104]:
#df['A'].fillna(value = df['A'].sum() , inplace = True)
#df['A'].fillna(value = df['A'].mean() , inplace = True)

In [105]:
data = {
    'Dept': ['CSE' ,'CSE' , 'CE','CE', 'EEE','EEE' ],
    'StudentName': ['S' , 'B' , 'A' , 'D', 'E' , 'E'],
    'Total_Marks': [100,200,150,250,100,150]
}

df = pd.DataFrame(data)
df

  Dept StudentName  Total_Marks
0  CSE           S          100
1  CSE           B          200
2   CE           A          150
3   CE           D          250
4  EEE           E          100
5  EEE           E          150

In [110]:
comp = df.groupby('Dept')

In [111]:
comp.mean()

      Total_Marks
Dept
CE            200
CSE           150
EEE           125

In [113]:
comp.describe().transpose()['CSE']

Total_Marks  count      2.000000
             mean     150.000000
             std       70.710678
             min      100.000000
             25%      125.000000
             50%      150.000000
             75%      175.000000
             max      200.000000
Name: CSE, dtype: float64

In [116]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [117]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [118]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [119]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [120]:
pd.concat([df1 , df2 , df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [121]:
left = pd.DataFrame({'key': ['K3', 'K2', 'K1', 'K0'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [122]:
left

  key   A   B
0  K3  A0  B0
1  K2  A1  B1
2  K1  A2  B2
3  K0  A3  B3

In [123]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [128]:
pd.merge(left , right , how = 'inner' , on = 'key')

  key   A   B   C   D
0  K3  A0  B0  C3  D3
1  K2  A1  B1  C2  D2
2  K1  A2  B2  C1  D1
3  K0  A3  B3  C0  D0

In [129]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [159]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [160]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [162]:
#pd.merge(left,right ,  how = 'inner' ,  on = ['key1' , 'key2'])  #inner means get only common

#pd.merge(left,right ,  how = 'outer' ,  on = ['key1' , 'key2'])

In [133]:
pd.merge(left,right , how = 'right' , on = ['key1' , 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [134]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [135]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [136]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [137]:
left.join(right , how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [138]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [3]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[11,22,22,44],
    'col3':['abc' , 'def' , 'ghi' , 'jkl']
})

df.head()

   col1  col2 col3
0     1    11  abc
1     2    22  def
2     3    22  ghi
3     4    44  jkl

In [140]:
df['col2']

0    11
1    22
2    22
3    44
Name: col2, dtype: int64

In [4]:
df['col2'].unique()

array([11, 22, 44], dtype=int64)

In [142]:
df['col2'].value_counts()

22    2
11    1
44    1
Name: col2, dtype: int64

In [143]:
df2 = df[(df['col1'] > 2) & ((df['col2'] == 22) | (df['col2'] == 44))]
df2

   col1  col2 col3
2     3    22  ghi
3     4    44  jkl

In [6]:
def times_square(x):
    return x*x

In [7]:
df['col1'].apply(times_square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [145]:
df['col1'].sum()

10

In [146]:
del df['col1']

In [147]:
df

   col2 col3
0    11  abc
1    22  def
2    22  ghi
3    44  jkl

In [148]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [149]:
df

   col2 col3
0    11  abc
1    22  def
2    22  ghi
3    44  jkl

In [150]:
df.sort_values(by='col2')

   col2 col3
0    11  abc
1    22  def
2    22  ghi
3    44  jkl

In [151]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [152]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [153]:
df2 = df.pivot_table(values='D' , index = ['A' , 'B'] , columns = 'C')

In [154]:
df2

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN